{"id":801,"text":"Go for the beer, stay for lunch.. Stopped for lunch.  Had s nice sandwich - very good but I wouldn't say exceptional.  Had it with chips and a pickle, but of which were fantastic.  Wish I knew the brands.  I don't drink during the day, but I bought some beer to go.  Just had their \"Granite Kiss Double IPA\", which was excellent.  Since it was early spring with the typical Massachusetts drizzle, was not children friendly.  On a good day it could be.  I'd recommend this for a nice lunch, or for the beer - a respite from the local powerhouse Tree House Brewery.","label":[[26,31,"FOOD"],[46,51,"FOOD"],[65,73,"FOOD"],[131,136,"FOOD"],[143,149,"FOOD"],[254,264,"BEER"],[283,306,"BEER"],[483,488,"FOOD"]],"Comments":[]}
{"id":802,"text":"Very loud and crowed. We've been there twice and both times there were no seats at the bar.  So we sat at a big communal table.  Not a big menu- and liquors are not main street for the most part.  Not many beers made in house.  Our waitress was...","label":[[112,126,"FEATURE"]],"Comments":[]}
{"id":803,"text":"Worth a stop. y husband a beer guy - so we always hunt the local breweries out. His comments: their New England IPA was not really a New England IPA. It was more like a standard IPA- clear and not fruit forward. The Pale Ale and Sour were...","label":[[100,115,"BEER"],[133,148,"BEER"],[178,181,"BEER"],[216,224,"BEER"],[229,233,"BEER"]],"Comments":[]}
{"id":804,"text":"Serendipitous Treat On A Rainy Day. We were in Boston staying at an AirBnB close by and went looking for dinner.  It was raining and we ducked inside this place just by chance.This was the best food we had in Boston!  Every dish we ordered was perfect.  The flavor was...exceptional.  Something as simple as brussel sprouts was cooked to a flavor I would have never thought possible - no brussel sprouts have ever equaled since.The atmosphere was quiet with lower lighting.  The service was not rushed but was very attentive to our needs.I would definitely recommend this place to anyone.","label":[[308,323,"FOOD"],[388,403,"FOOD"],[447,452,"VIBE"]],"Comments":[]}
{"id":805,"text":"Great microbrews. A pleasant location on Main Street, Hudson for sampling a great variety of on-site brewed beers.  Not much food, but welcomes their customers bringing food in, especially from all of the local shops.  Definitely worth a visit if you like microbrews!","label":[[20,28,"VIBE"],[41,52,"LOCATION"],[125,129,"FOOD"]],"Comments":[]}
{"id":806,"text":"Two stars off for NO PRICES listed for beer!!?. The two guys who handled our order, five stars for both.  Beer...3.5 to 4 stars for the two IPA's  I  had.  The music on that  night was unbelievably loud, and I walked around looking for any spot where you could talk without screaming...didn't exist, even...in the \"restaurant\" area of tables where the DJ was.  But for me the ultimate deal killer was NO FRIGGIN' PRICES listed for any of the beers!!  I understand changing the prices EVERY DAY...no problem, put them on a chalkboard if you have to!!   This seems to be an issue at several of the food and drink establishments I've been too recently and reviewed here, none of which I will ever return to for that reason alone.","label":[[140,143,"BEER"]],"Comments":[]}
{"id":807,"text":"Excellent Brewery. I came in for the first time last week after enjoying a few bottles of Idle Hands over the last couple of years.  Excellent beer and friendly service.  Lots of seating in the tap room.  Wide range of styles.  The price for the flight is on the higher side for 4 samples due to them being Belgian-style.  I enjoyed them and would come again once I am back in the area.","label":[[152,160,"VIBE"],[171,186,"FEATURE"],[246,252,"BEER"],[307,320,"BEER"]],"Comments":[]}
{"id":808,"text":"Harpoon Brewery. y family visited Harpoon Brewery in a recent visit to Boston for a tour.  We enjoyed the informative tour of the history and processes Harpoon uses to brew their local beer.  During the tour, there is a period of time where each tour participant can taste and drink many varieties of the Harpoon beer.  Following the tour, my family enjoyed pretzels in their Beer Hall.  The pretzels and sauces are made with their beer products, and were amazing.  We had our 11 year old son with us and he was able to enjoy the experience with his Harpoon Root Beer!  Great place for a local beer in South Boston's Seaport District!","label":[[84,88,"TOUR"],[118,122,"TOUR"],[203,207,"TOUR"],[246,250,"TOUR"],[334,338,"TOUR"],[358,366,"FOOD"],[392,400,"FOOD"],[405,411,"FOOD"],[617,633,"LOCATION"]],"Comments":[]}
{"id":809,"text":"Great beer and environment. . Stopped in on a weekend afternoon with my wife and 3 year old son. Because I had the fam I assumed I would only be grabbing some cans to go. Well, I was wrong. They had some games for kids to play with and there were some others around his age already playing that he jumped right in with. I was able to taste a couple different brews and enjoy a glass outside while we played some games with my son. The people working were friendly & very knowledgeable about their products. The most important part, the BEER IS GREAT! I liked them all but the Milkshake IPA was my favorite. Definitely a good place to stop in.","label":[[159,169,"BEER"],[204,209,"GAMES"],[383,390,"OUTDOOR"],[412,417,"GAMES"],[455,463,"VIBE"],[576,589,"BEER"]],"Comments":[]}
{"id":810,"text":"New Menu. We stopped in to the Tap Haloween night after Trick-or-Treating with the kids.  I was not delighted with the decision at first but they had a spot for right away on a Saturday night so we grabbed it.  We noticed the new menu right away....","label":[],"Comments":[]}
{"id":811,"text":"Great place. Great old New England atmosphere. Great beer... I had the Hop Goddess IPA.  Great staff... friendly, welcoming and knowledgeable.","label":[[23,34,"VIBE"],[71,86,"BEER"],[104,112,"VIBE"],[114,123,"VIBE"]],"Comments":[]}
{"id":812,"text":"Falmouth is lucky to have this place!!. We had the pleasure of dining at Bad Martha’s recently and had the most lovely experience! The setting is relaxed and pleasing to the eyes with a delightful patio and lawn with colorful flowers and tilting umbrellas. The beer was delicious, the sampler platter allow you to try out the wide array of beers. My personal favorite: The Tattooed Lady!! We enjoyed lobster rolls and a few large pies (the Margarita pizza is uh-maxing!). The best part was the service (attentive and helpful waitress) and the restaurants devotion to ensuring that their patrons felt comfortable and confident with Corona Virus restrictions. We can not wait to go back!!","label":[[146,153,"VIBE"],[197,202,"OUTDOOR"],[207,211,"OUTDOOR"],[246,255,"FEATURE"],[373,386,"BEER"],[400,413,"FOOD"],[450,455,"FOOD"]],"Comments":[]}
{"id":813,"text":"Nice Local Brewery. I liked the looks of the tasting room right when I walked in. My favorite beer there is the Descendant. I took the tour which was basically the same old info from any other brewery tour. The parking was easy there.I liked their beer and this should be part of a brewery visit when in the area I recommend seeing this one first then going to Everett to check out Night Shift and Idle hands.","label":[[112,122,"BEER"],[135,139,"TOUR"],[201,205,"TOUR"],[211,218,"FEATURE"]],"Comments":[]}
{"id":814,"text":"Good Food - Good Drinks - Good Atmosphere. I would have said great food, but honestly, it's a little inconsistent. Sometimes, though, it's delicious! The beer is good - although, admittedly, I seldom drink beer so I'm not an expert. I liked being able to sample first. Nice. Plus, there's a full bar,...","label":[[5,9,"FOOD"],[67,71,"FOOD"],[291,299,"FEATURE"]],"Comments":[]}
{"id":815,"text":"Awesome atmosphere, service and beer !. this  was my friend and I's first time at this brewery and we can't wait to go again. The guy and girl working the bar on sun 2\/23 were awesome! They listened to what types of beers we might like and made suggestions... As we were relaxing outside in the patio area, there was always staff people walking around cleaning up, making sure customers were all set .etc.. great service and great beer made for an awesome end to our girls weekend! I highly recommend this place and will always stop there when I go to the cape . We didnt eat there but the pizza and other food looked awesome!","label":[[0,7,"VIBE"],[280,287,"OUTDOOR"],[295,300,"OUTDOOR"],[590,595,"FOOD"],[606,610,"FOOD"]],"Comments":[]}
{"id":816,"text":"Great German beer. Indie617 sponsored an event at idle hands so we tried it out. They have a great selection of Belgian and German beer. They do not have a lot of parking but the over flow lot is not far away. We were very lucky because Spoko Polish Street food was selling stuff. Everything they sell is high quality. So we had good music, great beer and food and a good time.","label":[[6,12,"BEER"],[112,119,"BEER"],[124,130,"BEER"],[257,261,"FOOD"],[334,339,"MUSIC"],[356,360,"FOOD"]],"Comments":[]}
{"id":817,"text":"Great choice . I was staying nearby and just off a flight from London via Newark so a little tired. Wanted somewhere relaxed to have a drink and order take out. Loved the vibe here -  modern, industrial warehouse type feel with bare brick walls. Plenty of space...","label":[[184,190,"VIBE"],[192,212,"LOCATION"],[246,261,"FEATURE"]],"Comments":[]}
{"id":818,"text":"Brew Tour. This was such a surprising fun time!  My husband and I went to the tour \/ tasting that they host on Saturdays.  The tour was quick and really informative, and the beer was excellent.  The best part was that the warehouse opens up to local vendors... food, artists, clothing, and live entertainment.  Such an amazing find for a rainy day on the Cape.  Definitely going back.","label":[[5,9,"TOUR"],[78,82,"TOUR"],[127,131,"TOUR"],[222,231,"LOCATION"],[244,257,"FEATURE"],[261,265,"FOOD"],[319,326,"VIBE"]],"Comments":[]}
{"id":819,"text":"Great set up and darn good beers and ciders.. Nice addition to the beer\/cider family. Cool, rustic vibe and set up and products deliver with a nice variety of ciders and beers.","label":[[37,43,"BEER"],[72,77,"BEER"],[86,90,"VIBE"],[92,98,"VIBE"],[159,165,"BEER"]],"Comments":[]}
{"id":820,"text":"Hidden Gem, Friendly Staff. y husband and I ended up making our way to Turtle Swamp as part of a Jamaica Plain food tour, and it was the highlight of the tour.  We ended up staying after the other participants and the tour guide left because it was such a great place.  We tried the porter and the orange line, both of which were good beers.  We also had a chance to talk to the assistant brewer, who was friendly and answered all of our questions - he was clearly passionate about the brewery.  The two bartenders were also clearly knowledgeable about the beers and were also super-friendly.  Plus, the indoor-outdoor atmosphere was fun and accessible.    What a great neighborhood spot - for residents and drop-ins like us.","label":[[0,10,"VIBE"],[12,20,"VIBE"],[283,289,"BEER"],[298,309,"BEER"],[611,618,"OUTDOOR"],[634,637,"VIBE"],[642,652,"VIBE"]],"Comments":[]}
{"id":821,"text":"Fun visit - good local brews. Stopped by Bright Ideas for a quick sampling of local brews and a sandwich. Staff were friendly, beer refreshing and varied, and sandwiches were tasty. Definitely stop by after a visit to MOCA or just to grab a beer.","label":[[96,104,"FOOD"],[117,125,"VIBE"],[159,169,"FOOD"]],"Comments":[]}
{"id":822,"text":"6 stars....yes I think so. The beer selection is amazing. The atmosphere is great and inviting even if your solo. Lots of nice food options for a brew house with fast and friendly service.","label":[[86,94,"VIBE"],[127,131,"FOOD"],[171,179,"VIBE"]],"Comments":[]}
{"id":823,"text":"Neighborhood gem. We are all lucky to have these guys brewing in our neighborhoid. Great beer. Greater people. Tons given back to the neighborhood in a variety of ways. Feel good about the money you spend. Food is good. Always something interesting going on. Dont for get...egg sandwiches and great coffee in the AM. The other brew.","label":[[0,16,"VIBE"],[206,210,"FOOD"],[278,288,"FOOD"],[299,305,"FOOD"]],"Comments":[]}
{"id":824,"text":"Great place. . Drunken Rabbit Brewing is a lovely brewery. Bailey, our host, was helpful and informative. We highly recommend the Jackalope brown ale and the dry Irish stout. Great environment, lovely vibe.","label":[[43,49,"VIBE"],[130,149,"BEER"],[158,173,"BEER"],[194,200,"VIBE"]],"Comments":[]}
{"id":825,"text":"Nice Brewery!. Great local beer and love the name.  We had a few of their beer tastings and loved it so much we took a bunch back to our timeshare.  Nice indoor space for adults, not much to do for kids.  Local folks there, very nice to talk with.","label":[],"Comments":[]}
{"id":826,"text":"Running out of beer on a Saturday? Lame.. *Tried* to visit Tree House Brewing company to purchase a gift for a friend, and only after waiting in line for 30 minutes (1\/2 of the 1-hour wait) was I informed that they 'always run out on Saturday- the only day they run out.' I was also informed that I could 'visit the website to see how much beer would be made available' that day, and that I could 'gauge' if there 'would be enough' for it to be worth my while to visit. *Eyeroll*I drove an hour to get there, walked up a huge hill, waited in a huge line, only to find out that there is no take-away beer, only beer on tap, and that it was 'up to me' to gauge if they'd have any on my next visit? No thanks.  It shouldn't be *THAT* hard to be your customer.  Get your business in order, folks.  With a brand new facility attracting that many people, it's time to start preparing enough product to supply demand, or don't bother opening your doors in the first place. I, for one, won't be back.","label":[[589,603,"BEER"]],"Comments":[]}
{"id":827,"text":"Amazing Beer; I'd Like Some Couches. Nightshift is an awesome addition to Boston's continually burgeoning brewery scene. With a selection that spans almost every style of beer and an ABV range from 3.2 to 10.1, they have something for everybody. Awake, The 87, and El Lechedor (apple brandy oak barrel-brewed) are favorites. My one issue with going to the actual brewery is that it just isn't as cozy as competitor Lamplighter and doesn't boast the food that similarly set-up Harpoon does. There is a food truck and I just haven't happened to be there at the right time for it, so this would probably make a big difference. Next time, I'll make sure the truck's there. In the meantime, I'll keep stocking up on The 87 at Trader Joe's.","label":[[246,251,"BEER"],[253,259,"BEER"],[265,276,"BEER"],[449,453,"FOOD"],[501,511,"FOOD"],[711,717,"BEER"]],"Comments":[]}
{"id":828,"text":"Up and Coming Brewery...Great Tour!. This was our second brewery stop of the day.  After visiting Trillium we moved on to Castle Island where we had reserved an afternoon tour.  This was a much more relaxed environment, with plenty of seating, a big TV, corn hole, and probably the best brewery tour I've experienced.  It's a small and growing brewery.  The tour guide was friendly and knowledgeable.  He let us go right up to the tanks (masher, fermenting tank, etc.).  And he poured their upcoming Octoberfest beer for us to sample right out of the fermenting tank.  I tried a sampler flight of beers that were cold and delicious.  We will be back.  I see good things for Castle Island Brewery as they continue to grow.","label":[[30,34,"TOUR"],[171,175,"TOUR"],[199,206,"VIBE"],[225,242,"FEATURE"],[250,252,"FEATURE"],[254,263,"GAMES"],[295,299,"TOUR"],[358,362,"TOUR"],[587,593,"BEER"]],"Comments":[]}
{"id":829,"text":"A great local brewery. I wish that I lived near, because Start Line is a great place to hang out and drink great beer. I'm from the UK, so craft beer is familiar to me, although the prices are high for us here because of the £ being weak. There was a great range to choose from, I had the 4x5oz tasting tray which is a good idea if you are not sure what you might like.There is a good laid-back atmosphere and the place is big enough to be comfortable to large parties.  There is a back yard which has another small bar and there are tvs out there (playing Golf during our visit).  There are also some corn hole boards which customers can use (we Brits beat our US cousins !).  We had a bar snack between us of Humous, olives and pitta bread, which was fine.  I didn't look at the menu so can't comment on the price. I was in a party of 5 adults but there were many families there enjoying the atmosphere.  I think that this place is relatively new as it used to be some kind of tomato growing venture.  It seems that the transitiion from that is not fully complete as there are some seemingly unused buildings to the rear.  The staff were friendly.  On the whole I recommend start line as a local bar \/ relaxing place,","label":[[385,394,"VIBE"],[455,468,"FEATURE"],[482,491,"OUTDOOR"],[534,537,"FEATURE"],[602,611,"GAMES"],[691,696,"FOOD"],[711,717,"FOOD"],[719,725,"FOOD"],[730,741,"FOOD"],[1204,1212,"VIBE"]],"Comments":[]}
{"id":830,"text":"Great spot for an evening drink. Stopped by to hang out, listen to some live music, and enjoy a drink. We each had one of their stout selections and they were excellent.  Dog friendly, board games available, and good brews - a nice place to relax.","label":[[77,82,"MUSIC"],[128,133,"BEER"],[171,183,"DOG"],[191,196,"GAMES"]],"Comments":[]}
{"id":831,"text":"Was Excited to Try, Way Too Many IPAs. If you are not a hop head, you are going to be a bit disappointed by their beer selections. Mostly everything on their beer menu is IPA (they had 18 beers, 4 of which were not IPAs). I get it that IPAs are the \"in\" thing right now, but variety is the spice of life, and the spice here was severely lacking. Besides that, the atmosphere is really cool since they are located in an old sheet metal factory. The staff was extremely friendly and there were plenty of places to sit. They even have an outdoor patio area, but we decided to sit inside since it was a bit warm. You are able to bring outside food inside. They also have a very small food menu as well (mostly snacks).The only odd thing about Dorchester Brewing Company is that the men's room only has urinals, no toilets. Overall, we would probably go back, but very disappointed on the lack of beer styles.","label":[[33,36,"BEER"],[171,174,"BEER"],[215,218,"BEER"],[236,239,"BEER"],[385,389,"VIBE"],[419,442,"LOCATION"],[468,476,"VIBE"],[492,515,"FEATURE"],[535,542,"OUTDOOR"],[543,548,"OUTDOOR"],[680,684,"FOOD"],[706,712,"FOOD"]],"Comments":[]}
{"id":832,"text":"Flavorful, unique beer. This is a great spot to pick up some great tasting, unique beers. They have a wide selection of stuff but my favorite is the Twister series, a smoothie style sour. Really unique and delicious flavor combinations make this a must visit place.","label":[[149,156,"BEER"],[182,186,"BEER"]],"Comments":[]}
{"id":833,"text":"Went twice in two days!. Great beer and a great atmosphere. Food truck, waterfront and dog-friendly! Unique beers and games. Can’t wait to go back!","label":[[60,70,"FOOD"],[72,82,"LOCATION"],[87,99,"DOG"],[118,123,"GAMES"]],"Comments":[]}
{"id":834,"text":"Harpoon Fest is OVERRATED!. If you want to wait in an hour long line, pay $20 for admission, and then $6 a beer (after waiting in ANOTHER long line), only to stand around in a parking lot with nothing to do but chat, THIS IS THE PLACE TO BE!  If you're normal, go to Clarke's, Whiskey Priest, Atlantic Beer Garden....","label":[],"Comments":[]}
{"id":835,"text":"Rude staff member and high prices. A man behind the bar serving beer at the time I stopped in immediately gave me a rude tone and said that I looked “hella young” so he would definitely need to see some ID. I was almost 23 at the time and I get ID’ing people but it just made me feel like I was unwelcomed. Next time just ask to see a person’s ID instead of insulting them and making them feel uncomfortable right as they walk through the door. I’d also like to add that their prices are pretty high compared to other local breweries.","label":[],"Comments":[]}
{"id":836,"text":"Great place. y daughter and I stopped in here for lunch on a busy Tuesday afternoon in Oak Bluffs. We sat at the bar as there was somewhat of a wait for a table. Great atmosphere casual and fun. We both had sandwiches with awesome fries.","label":[[50,55,"FOOD"],[179,185,"VIBE"],[190,193,"VIBE"],[207,217,"FOOD"],[231,236,"FOOD"]],"Comments":[]}
{"id":837,"text":"Overrated and terrible service.. Awful service. Rude, so much so it was borderline sexist how different the wait staff was with tables of men vs women. Very overrated, don’t waste your hard earned money.","label":[],"Comments":[]}
{"id":838,"text":"Great beer, nice Saturday tour. y son and I went for the 1 pm tour and really enjoyed it.  The tour guide Noah was fantastic, funny and controlled the crowd (25 or so) when things got a bit noisy.  They take you right into the brewery, through the whole process.  Long tour (over an hour for this little place!) and every question gets answered.Sad to see those bourbon barrels just sitting there...  maybe a bourbon barrel aged stout in the future?Can’t wait to return!","label":[[62,66,"FEATURE"],[95,99,"FEATURE"],[269,273,"FEATURE"]],"Comments":[]}
{"id":839,"text":"Beer tasting. The Mystic Brewery, located at the base of Admiral's Hill in an old warehouse near the Mystic River, offers some truly fine brews. Our local friends introduced us to this brewery that specializes in farmhouse ales & we had an enjoyable evening of beer tasting. Their dry hopped sour ales are really interesting - I liked the luminous ruins. Their Belgian brews are also very good. Great atmosphere - friendly locals, great service.","label":[[78,91,"LOCATION"],[213,227,"BEER"],[281,301,"BEER"],[339,353,"BEER"],[361,368,"BEER"],[414,422,"VIBE"]],"Comments":[]}
{"id":840,"text":"Good But!  Watch out for wine prices. I know it's an ale place but if you are in a group, someone might want some wine....A glass of wine here is way too expensive for the type of place it is.  I understand that they are partnering with a local winery, but $10 per glass, that's crazy.  We are not in Manhattan!!","label":[],"Comments":[]}
{"id":841,"text":"Wonderful beer!. We visit almost every week.  Sometimes I just fill growlers or pick up one of the new can options while other times we hang out with friends exploring the beer options. The beer selection changes weekly and we have several favorites.  The staff is friendly and knowledgeable.  They even have a room you can book for private functions.  We had a going away party for a work friend and it was really a great spot.  The only downside I see is that if you are not a beer drinker then there are no options.","label":[[68,76,"BEER"],[103,106,"BEER"],[265,273,"VIBE"],[333,350,"FEATURE"]],"Comments":[]}
{"id":842,"text":"Great Breakfast and Dinner!. We went to Paramount a bunch of times while in Boston for the Marathon.  The staff is first class and very attentive.  It is a friendly and warm place.  The food is terrific with a broad menu not only for breakfast but also for lunch...","label":[[6,15,"FOOD"],[20,26,"FOOD"],[156,164,"VIBE"],[169,173,"VIBE"],[186,190,"FOOD"],[234,243,"FOOD"],[257,262,"FOOD"]],"Comments":[]}
{"id":843,"text":"Greasy Luck Brewery for the Win !. This place is awesome! The food , staff is awesome! Great bands on both sides with the Vault featuring national acts these days. Musical bingo, acoustic and dj's on thePubside!! Check The Greasy Luck out when you are in town !","label":[[49,56,"VIBE"],[62,66,"FOOD"],[93,98,"MUSIC"],[172,177,"FEATURE"],[179,187,"FEATURE"]],"Comments":[]}
{"id":844,"text":"Great New Location. Idle hands has had a tough go in the past in regards to location, but their new spot is perfect and I'm glad to see them doing well!Nice taproom with plenty of room, snacks, and great list of beers to sample. Very comfortable spot for groups or coupes. We will be back!","label":[[170,184,"FEATURE"],[186,192,"FOOD"],[234,245,"VIBE"]],"Comments":[]}
{"id":845,"text":"Good IPA. Tried Navigation over the weekend.  The IPA was good.  My brother had the stout which was also good. The tap room was small but didn't feel cramped.  I would stop there again.","label":[[5,8,"BEER"],[50,53,"BEER"],[84,89,"BEER"]],"Comments":[]}
{"id":846,"text":"Greatly Disappointed!. I stopped here after an evening event and ordered a grilled chicken sandwich  and sweet potato fries to go. The chicken was cold, not even reheated, and the fries were barely lukewarm. When I called the next day to share my experience with the staff,...","label":[[91,99,"FOOD"],[118,123,"FOOD"],[135,142,"FOOD"],[180,185,"FOOD"]],"Comments":[]}
{"id":847,"text":"A great place for good beer and light meal. We visited on opening night, and then a number of times since.  The venue is a renovated mill and is amazing.  The beer is brewed on premises using local ingredients where possible.  You get a full measure in your glass, no excessive head and it...","label":[[123,137,"LOCATION"]],"Comments":[]}
{"id":848,"text":"An enjoyable stop. Fort Hill Brewery was the third stop out of seven breweries visited on Saturday.  It is a hidden gem in Easthampton, MA.  The facility is adjacent to a rail trail. I can't think of a better place for a break from my exercise routine!   The beers are wonderful.  The patrons were all having a great time.  I am truly looking forward to a return trip!","label":[[109,119,"VIBE"]],"Comments":[]}
{"id":849,"text":"Great addition to our day out!. Fast and friendly service!  Great outdoor seating, with limited beer choices being served outdoors as well. Had a food vendor there with food options that looked good.  Great way to support local.  The beer speaks for itself and alone is worth the trip!","label":[[41,49,"VIBE"],[66,73,"OUTDOOR"],[122,130,"OUTDOOR"],[146,150,"FOOD"],[169,173,"FOOD"]],"Comments":[]}
{"id":850,"text":"Great stop for a Brewery. Located in the old Jack's Abby location.  Taproom is small and crowded but worth it as the beer was really good and a wide selection of varieties.  Employees were great to talk to and service was great even with the crowd in there.  I enjoyed all of their beer and hope they continue to do so well. They have most beers available in cans or growlers to go.Parking is very easy there.","label":[[359,363,"BEER"],[367,375,"BEER"],[379,389,"FEATURE"]],"Comments":[]}
{"id":851,"text":"A must for microbrew fanatics.... Had the pleasure to visit River Styx this weekend. If you're an IPA fan (as I am), they had 6 excellent choices. But why only have one when you can get a flight and enjoy them all. Plus, they have corn-hole, a hand shuffle board, Jenga and so much more. BYOF and dog-friendly. An absolute must on your MA microbrew schedule.","label":[[98,101,"BEER"],[188,194,"BEER"],[231,240,"GAMES"],[249,262,"GAMES"],[264,269,"GAMES"],[297,309,"DOG"]],"Comments":[]}
{"id":852,"text":"Great Small Bar for Tasting. Relaxing at the bar, talking to the staff, and trying beer . .  great experience. The bartender was fantastic, she got us set up with tastings right away, was knowledgeable on the process and a fun storyteller. It was not very crowded the day we were there but plenty of folks came in to refill growlers and sit down for a pint or tasting. We enjoyed the experience and glad we found the place!","label":[[6,11,"LOCATION"],[324,332,"BEER"]],"Comments":[]}
{"id":853,"text":"Great landing place after a visit to Mass MoCA. Conveniently located in the same complex as Mass MoCA (a converted textile mill), you can't fault yourself for leaving the museum with weary feet and tired eyes and needing to sit down for a beer. The beer is good and brewed on site. We were able to refresh with a pint at an outdoor table where it was more quiet and peaceful than the indoor atmosphere.","label":[[115,127,"LOCATION"],[324,331,"OUTDOOR"]],"Comments":[]}
{"id":854,"text":"Excellent Pils beers. This local brewery brews German and Czech style beers. The list is short, but all beers are excellent. You can sip your beer inside or outside in the beer garden. Some table games are at the customers disposal.","label":[[10,14,"BEER"],[47,53,"BEER"],[58,63,"BEER"],[157,164,"OUTDOOR"],[177,183,"OUTDOOR"],[196,201,"GAMES"]],"Comments":[]}
{"id":855,"text":"Let down. ting a group of us for drinks, food and laughter....the food took FOREVER....like I could have grown a mullet before getting my food...it was good when I received it over an hour after ordering it.....FYI the food should be cooked in a full kitchen not a food truck packed with 6 people working on 1 order at a time....the beer was ok.....thankfully the games were on as a distraction for my hunger.....wont be back....","label":[[41,45,"FOOD"],[66,70,"FOOD"],[138,142,"FOOD"],[219,223,"FOOD"],[265,275,"FOOD"],[364,369,"GAMES"]],"Comments":[]}
{"id":856,"text":"Good time . Was there today for the first time and it was very good. Nice interior and cool patio. Tropic thunder was excellent and the music today was great. Our server, Kristi (aka Tabitha) was prompt and pleasant helping us pick our beers.  Going back soon","label":[[92,97,"OUTDOOR"],[99,112,"BEER"],[136,141,"MUSIC"]],"Comments":[]}
{"id":857,"text":"Chuck E. Cheese with beer!. When you walk in you know you are entering a brewery, however once you enter the main room there are kids running ALL OVER the place. There was even a kids birthday party going on. Not really what we expected but the beer was good. Would have liked to stay longer but wasn't in the mood for screaming, crying kids. People were awesome and the beer was great, just didn't want to have drinks with little ones. Check it out if you don't mind the commotion.","label":[[355,362,"VIBE"]],"Comments":[]}
{"id":858,"text":"do not recommend the food. place is nice for a beer and ice cream but don't order any food especially the chicken. overpriced and small portions.","label":[[21,25,"FOOD"],[56,65,"FOOD"],[86,90,"FOOD"],[106,113,"FOOD"]],"Comments":[]}
{"id":859,"text":"Food was good . Food was good and beer was good. They will not do flights, they say it is still due to Covid so that was disappointing. But the beer was good, had a couple of 10 ounce pours to see what we liked. Lunch was good, we...","label":[[0,4,"FOOD"],[16,20,"FOOD"],[212,217,"FOOD"]],"Comments":[]}
{"id":860,"text":"Good fun on the beerventure . Popular spot on the Cambridge beerventure.   Had a great double IPA.  Great selection.  Fun atmosphere. Lively crowd. I'd go back!","label":[[87,97,"BEER"],[118,121,"VIBE"],[134,140,"VIBE"]],"Comments":[]}
{"id":861,"text":"Beer and food earn high marks - service needs improvement. Stopped in over the Thanksgiving Holiday weekend with friends.  Overall review - Cute venue - good lighting - Ample seating.   Beer was super tasty - the food menu while limited had something that catered to everyone.  We opted for the Nachos (gigantic) and the goat...cheese\/fig and pepperoni pizza- with cauliflower crust.  The Pizza was fantastic.The Service however could use improvement.  The Brewery was not crowded so we were disappointed by the lack of service. We were handed a stained paper menu - - and the Beer tender did not ask if we had any questions about the beers.  She did not offer any suggestions, nor try to engage us in conversation of any kind and frankly she was more interested in sitting at the bar looking at her phone.  The basis of my review is that not only have I owned a restaurant, I also worked as a Beer tender for a Microbrewery.  Making small talk with the customer is a big part of the business success.   Asking if you're a first time customer,  suggesting some food bites, pointing out your most popular products - and explaining the nature of the product or how the name was created - all of this in-person marketing is what makes people share their positive experiences.  Beer - we thoroughly enjoyed the Fuzzy Wuzzy it was an easy drinking beer with good flavors.  The Super Galaxy was another high performer! The Songbird was another popular try among our group.  The Jackalope was an interesting offering but not one we wanted to order beyond the flight tasting.  We also wanted to try the BobN for Peaches - but the server didn't check in with us so we decided to leave after we finished our food. There was a Walk in fridge to purchase package goods - and we looked for Super Galaxy but alas there was none.  We did not see any pricing on the walls to suggest whether they offered Growler or Crowler fills.  They did have lots of Merch - Tshirts\/Sweatshirts and stickers.Decor - open space - bar seating and individual tables.  Good lighting - not too loud - ample TVs for watching sports.  Outdoor seating available in nicer weather.Overall rating was very good - but the rating is solely based on Beer and Food.The service was flat.  That being said - we will return and hope the service is better on our next trip.","label":[[140,144,"VIBE"],[169,182,"FEATURE"],[213,217,"FOOD"],[295,301,"FOOD"],[321,325,"FOOD"],[328,334,"FOOD"],[335,338,"FOOD"],[353,358,"FOOD"],[389,394,"FOOD"],[1307,1318,"BEER"],[1372,1384,"BEER"],[1417,1425,"BEER"],[1472,1481,"BEER"],[1595,1611,"BEER"],[1698,1702,"FOOD"],[1777,1789,"BEER"],[1986,1996,"FEATURE"],[2072,2075,"FEATURE"],[2098,2105,"OUTDOOR"],[2215,2223,"FOOD"]],"Comments":[]}
{"id":862,"text":"Business people turned away. Went there with my colleague but we weren’t let in after a business meeting in Boston. Apparently internationally approved driving licenses don’t qualify as IDs at this place. To note, we are both in our 30’s. We went to a bar close by, and lo...and behold, they accepted our driving licenses there as IDs. So, if you aren’t US citizens bring your passports if you want to go to this place.","label":[],"Comments":[]}
{"id":863,"text":"Great place. Fully enjoyed the atmosphere here. They had an excellent Grateful Dead cover band and the beer was quite good too. Highly recommend checking them out.","label":[[90,94,"MUSIC"]],"Comments":[]}
{"id":864,"text":"Good selection of beers 🍻🍻. Went for the second time, a good selection of beers. I really enjoyed the Mexican lager.  It was all good that we tried.  Will go back.  Nice large area to sit.  They have cans to go. The had a small area to have food made.  Great place!","label":[[104,117,"BEER"],[172,182,"FEATURE"],[202,212,"BEER"],[243,247,"FOOD"]],"Comments":[]}
{"id":865,"text":"Great micro brew. I have been to their tap room on a couple of occasions and it was great. We talked to the brewmaster and he told us all about the process and the products the make. It's a nice hidden gem.","label":[[195,205,"VIBE"]],"Comments":[]}
{"id":866,"text":"Original bar and restaurant. Our first experience of clam chowder! Super friendly staff and if we hadn't been driving to our destination would have loved to stay sample the local beers, especially coming from Belgium! Original and creative restaurant and nice friendly atmosphere.","label":[[0,8,"VIBE"],[53,65,"FOOD"],[73,81,"VIBE"],[218,226,"VIBE"],[231,239,"VIBE"],[260,268,"VIBE"]],"Comments":[]}
{"id":867,"text":"Far from Great. I visited 3 Cross Brewery on Saturday with my sister.  It was a disappointing visit.  First it is hard to find.  We drove past it several times before my sister spotted a sign that was more hidden than useful.  The main sign is above the door on the backside of the building away from the street.  The two beers that we tried needed some work.  The owner is working hard but really should have a couple mainstays that he hones to perfection.  I say this as a beer lover that has visited over 225 craft beer breweries!  My conversation with the owner\/brew master was good.   He seems like a real nice guy.  My other complaint is their limited hours.  There are two other breweries in the town.  You can visit them at the same time around noon but then have to wait until 5 to visit 3 Cross.  This is a buzz kill if you are on a brewery crawl.  The taproom is large with lots of seating.  With a little tweaking 3 Cross can be something special!  I wish them luck.","label":[[885,900,"FEATURE"]],"Comments":[]}
{"id":868,"text":"Don't wear a tee shirt if you want service. ception was great.. welcomed warmly and sat with a smile. Ended there.1 drink and I was never there... bartender eyed right over me every time he passed. Might have been my Mearl shirt or my jeans and boots, but I sat ignored at the...bar for more than 10 mins. Had to have the hostess cash me out.","label":[],"Comments":[]}
{"id":869,"text":"Good selection of beers. Give it a 3.5 stars. Was there with some folks at night time for some drinks. There is a good selection of beers. There is even a tasting tour in the back. The beer prices are reasonable. The don't have much in food, but they have chips, guacamole dip and salsa. There are plenty of board games. They even let you bring in your own food to eat. You can even order food at a restaurant and deliver to this place. My issue is that they only have 2 staffs working at the front bar. There were about a dozen customers in the front and it took a bit for them to ask you what you like to drink.","label":[[163,167,"TOUR"],[236,240,"FOOD"],[256,261,"FOOD"],[263,272,"FOOD"],[273,276,"FOOD"],[281,286,"FOOD"],[314,319,"GAMES"],[389,393,"FOOD"]],"Comments":[]}
{"id":870,"text":"Hidden gem. This place is only about a 10 minute drive from Treehouse. It's tucked away a bit, on a farm off the main roads. We loved their beer, mead, music and vibe. I think if you are a beer lover in the area this is a must see. Try their Nobel Birch.","label":[[0,10,"VIBE"],[100,104,"LOCATION"],[146,150,"BEER"],[152,157,"MUSIC"],[242,253,"BEER"]],"Comments":[]}
{"id":871,"text":"Good stuff after a long wait!!. Finally opened recently after what seemed forever waiting in news\/discussion. Need to up capacity and number of beers but beautiful set up and great staff have them hitting ground running!! Will be back!!","label":[[154,163,"VIBE"]],"Comments":[]}
{"id":872,"text":"What a gem! And they have toys for kids!. Any brewery that has a kid section of toys for the young ones to play gets a top rating with us! The kids were occupied with the play area while my husband and I could easily enjoy sampling some of the wonderful beers that they have. Relaxed atmosphere and a great place to stop! Highly recommended!","label":[[26,39,"FEATURE"],[80,84,"FEATURE"],[276,283,"VIBE"]],"Comments":[]}
{"id":873,"text":"Ok beer with a slow food truck. Super excited to have a local brewery next to a Apple orchard. Beer selection was limited for those who rather a dark brew. Was at least hoping for a fall beer but still had blueberry on tap. Settled for a rye which was tasty. Not sure I could drink anything more than a sample glass though. Husband had Double IPA and Session ( both his go to brews) he said they lacked flavor. Food truck had a 40 minute wait for a pretzel with a mustard packet. No thank you. Also be warned dogs are allowed everywhere here including the tap room.","label":[[20,30,"FOOD"],[206,215,"BEER"],[238,241,"BEER"],[336,346,"BEER"],[351,358,"BEER"],[411,421,"FOOD"],[449,456,"FOOD"],[509,513,"DOG"]],"Comments":[]}
{"id":874,"text":"Best brew in Hudson. The service is great and the warm pretzels are a perfect pairing.  The place is \"BYOF - Bring your own food\" other than the pretzels.  You'll love the selections as the brewmasters there are always coming up with something to fit all palates.","label":[[55,63,"FOOD"],[145,153,"FOOD"]],"Comments":[]}
{"id":875,"text":"Spectacular microbrews!. Great microbrews. Family friendly even though it is a brewery. Welcome locals, families and beer lovers!","label":[[43,58,"FEATURE"]],"Comments":[]}
{"id":876,"text":"Second time here was not a charm. We were in the neighborhood and decided to pay a second visit.  The beers were really good.  The tomato soup with the grilled cheese sandwich croutons was both clever and tasty. The problem we had was that the price on the menu and the price...on the final tab differed for one of our beers.  A 10 oz version of this beer was listed at $5 and a 16 oz at $7.50.  I wanted to try this beer and $5 was an okay \"trying\" price for a 10 oz second beer with my meal.  After we we got the tab and paid it, we noticed we paid $7.50 for the listed $5 beer and pointed out the 50% increase to our waitress.  She said she'd have to take this to her manager.  We waited, basically wondering if she would give us a cash refund or a credit card credit.   Neither, as it turns out.  She told us her manager said they would change the menu.  First:  Their mistake and good customer relations suggests something other than \"get over it\" as a response.  Second, if you are going to send that message, don't send the waitress to do it.  Bring the bad news yourself.  Anyway, this place is scratched from our list of breweries to drop in on.  And, also, this is the second place we've been in recently where there was a discrepancy between the menu price and the price charged.","label":[[138,142,"FOOD"],[167,175,"FOOD"]],"Comments":[]}
{"id":877,"text":"Delicious food and fun flights of beer!. We stopped here for lunch and flights of beer. I had the clam chowder and chicken wings off the appetizer menu. Both were good size and delicious. There are several flights to choose from. I did the sweet and sour. I really liked the beer. We sat and ate and watched the Patriots. A very casual enjoyable restaurant\/brewery. We did not take the tour but it is only $3 and includes tastings from what I read. Probably more than worth it.","label":[[23,30,"BEER"],[61,66,"FOOD"],[71,78,"BEER"],[98,110,"FOOD"],[115,128,"FOOD"],[206,213,"BEER"],[329,335,"VIBE"],[386,390,"TOUR"]],"Comments":[]}
{"id":878,"text":"Up and Coming Business. Black Hat Brew Works has been a positive presence in the town for two years now, filling a niche.  They offer good tasting brews, a fun atmosphere and the folks running and working there are very friendly.  Its great to see nice people being successful in an adventure that they believe in.  Its obvious that they have a growing following and if you've never tried their offerings, I highly recommend it.","label":[[156,159,"VIBE"],[220,228,"VIBE"]],"Comments":[]}
{"id":879,"text":"Good, but pricey, poor servuce. Went with two colleagues while in town for a conference. Neat ambiance-simple but chic. Small menu. Our server, Mary, was nice, but slow and didn't know many of the items on the menu, hadn't tried anything! We tried the pig tails (save your money -...","label":[],"Comments":[]}
{"id":880,"text":"Good brewery for a rainy afternoon. Stopped by the Lamplighter on a rainy Saturday afternoon. The place was packed! Very good beers. Our favorites included Looking Glass, Yaks on the Phone, Metric Systems, and Neon Nights (there were four of us). Bar snacks were available and were pretty good. We were...in the back bar and it was quite loud, but lots of fun. Great place to people watch.","label":[[156,169,"BEER"],[171,188,"BEER"],[190,204,"BEER"],[210,221,"BEER"],[251,257,"FOOD"]],"Comments":[]}
{"id":881,"text":"New brewery hits a home run at opening!. Just opened (soft) on 12\/8 and is nailing it. Great beer across the menu and a really beautiful set up. All ready for next visit!!","label":[],"Comments":[]}
{"id":882,"text":"These people know how to make beer!. The beer here was fabulous- best Kolsch, great ESB, nice IPA, good fruit blends.  The Season of Hell Saison made it worth a return visit","label":[[70,76,"BEER"],[84,87,"BEER"],[94,97,"BEER"],[123,144,"BEER"]],"Comments":[]}
{"id":883,"text":"Good local beer. You can choose your beer among a long list. The setting is nice, you can eat something at the Ecuadorian street food stand.","label":[[129,133,"FOOD"]],"Comments":[]}
{"id":884,"text":"A Thoroughly Enjoyable Hidden Gem. We stopped at Homefield Kitchen & Brewery after a visit to Tree House Brewing Company in nearby Charlton, both excellent but completely different experiences. Homefield is very small, tucked in an out-of-the-way location underneath an antique shop. The staff was very friendly and accommodating, and...","label":[[23,33,"VIBE"],[212,217,"LOCATION"],[256,282,"LOCATION"]],"Comments":[]}
{"id":885,"text":"Great Place!!. Took an Uber here from Boston Common during the week about 4PM.  We sat at the bar and had a UFO flight.  We loved the Georgia Peach Beer-and brought a 6 pack to take home.Large place-looks like it would be a fun time on a weekend.  At 4PM there were still quite a few people enjoying an after work beer.","label":[[112,118,"BEER"],[134,151,"BEER"]],"Comments":[]}
{"id":886,"text":"Mayflower Brewery Rocks!. We were headed to the Sam Adams brewery tour when my mom noted there was a brewery in Plymouth as we were passing through. We were already told the Sam Adams tour was \"touristy\" so we figured hey, might as well stop at Mayflower. OMG we are so glad we did! The staff was beyond nice and friendly, the samples are HUGE, and the tour was very interesting. Oh and it's all FREE! We had a blast and I would recommend this to anyone.","label":[[313,321,"VIBE"],[353,357,"TOUR"]],"Comments":[]}
{"id":887,"text":"Very Cool Place. y fiancé and I stopped in after a hike in the area and it was well worth a stop to check it out. Selections were good and the atmosphere inside was cool too!","label":[[5,9,"VIBE"],[165,169,"VIBE"]],"Comments":[]}
{"id":888,"text":"Good pub food.. The old building, the eclectic menu, and the brewery's story are all pretty interesting. The food was good. A slice of the giant chocolate cake (with beer in the recipe) easily fed four people. The service was challenged to keep up, as seems to be...","label":[[9,13,"FOOD"],[20,32,"LOCATION"],[109,113,"FOOD"],[155,159,"FOOD"]],"Comments":[]}
{"id":889,"text":"A must try. This is nice place with a good beer and drink menu. The only drawback is their limited hours d\/t Covid, but they have  plenty of outdoor as well as indoor seating. A must try if ever in the area.","label":[[141,148,"OUTDOOR"]],"Comments":[]}
{"id":890,"text":"Great for a quick lunch before the ferry. Stopped by here on the way to the ferry after our quick one day visit. Great fish sandwich! Peanuts were fun to snack on. Their double IPA was great and the wine selections were decent. I drank only Massachusetts beers on our trip to the...","label":[[18,23,"FOOD"],[124,132,"FOOD"],[134,141,"FOOD"],[170,180,"BEER"],[199,203,"BEER"]],"Comments":[]}
{"id":891,"text":"Ignorant and rude to out of state residents. One star is too much.I just moved to Worcester from WV, so I still have an out of state license. Before I moved, I had a birthday and had to get a new ID since it expired. Since I opted to get the federal ID, they made me a temporary one to hold on to along with my old one. Evidently, it's against the brewery's \"policy\" not to honor those, even though I had my old ID. Will never go back.","label":[],"Comments":[]}
{"id":892,"text":"Quality Beer and setup!!. Enjoy asap as will be busy and bustling damn soon!!...Just opened and ready to make a mark with good variety and atmosphere!!","label":[],"Comments":[]}
{"id":893,"text":"Great Food and Beer. We went to the Stone Cow Brewery on a Sunday afternoon. Everybody was having a great time.  It is a very family friendly atmosphere. There is a large selection of beers to chose from. We both had the half chicken with roasted vegetables and corn bread. Large portion at a reasonable price. The meal was excellent. The staff is also very friendly.","label":[[6,10,"FOOD"],[126,141,"FEATURE"],[226,233,"FOOD"],[247,257,"FOOD"],[262,272,"FOOD"],[358,366,"VIBE"]],"Comments":[]}
{"id":894,"text":"Dinner at the Barrington Brewery. Came here for dinner while staying in the area.  We had the nachos and a cob salad to share, accompanied by two fine ales.  Both the food and drink could not be faulted  and I would have no hesitation in recommending this place if you...are looking for food in a relaxing environment with excellent servic","label":[[94,100,"FOOD"],[111,116,"FOOD"],[167,171,"FOOD"],[297,305,"VIBE"]],"Comments":[]}
{"id":895,"text":"Live music is great, good beer, not much food. Wish there was more food offered.......I know it is hard to have beer and entertainment with food, but it would be amazing!","label":[[5,10,"MUSIC"],[41,45,"FOOD"],[67,71,"FOOD"],[121,134,"FEATURE"],[140,144,"FOOD"]],"Comments":[]}
{"id":896,"text":"Local flavor - nice place for a gathering.. A nice place for a comfortable gathering. Quiet enough to hear each other speak with just enough background buzz to feel connected to the simple and well cared for space. This local brewery supports local initiatives. This summer a Thursday - Sunday 'farmers market' called...","label":[[63,74,"FEATURE"]],"Comments":[]}
{"id":897,"text":"Stopped by with friends for. Stopped by with friends for dinner & beers and I couldn’t be more impressed.  Despite all the chaos these times present, the experience was outstanding. I chose a flight of beers to sample. The Cambridge Amber and the Benovelence were two of my favorites. I...had the Fish n Chips for dinner and the food was fantastic and the portions, generous. Service was excellent and all the staff, very friendly and helpful! I would definitely come back!","label":[[192,198,"BEER"],[223,238,"BEER"],[247,258,"BEER"],[297,301,"FOOD"],[304,309,"FOOD"],[314,320,"FOOD"],[329,333,"FOOD"],[422,430,"VIBE"]],"Comments":[]}
{"id":898,"text":"Bring your well behaved dog for a beer. There is a nice selection beer and a friendly atmosphere.  Certainly something to please everyone.  I love that you can bring your dog too.","label":[[24,27,"DOG"],[77,85,"VIBE"],[171,174,"DOG"]],"Comments":[]}
{"id":899,"text":"Excellent staff, great food, great beer. These guys are the best.  One of our party has mobility issues.  They went above and beyond to provide a wonderful experience.  The other staff were great and so was the food and beer.  I look forward to visiting again the next time we are...in Haverhill.","label":[[23,27,"FOOD"],[211,215,"FOOD"]],"Comments":[]}
{"id":900,"text":"good food just ok service. Had breakfast here one morning on a recent trip to Boston.  It was the recommendation of the concierge from the Commonwealth Hotel.  The food was excellent but the service was just ok.  After a great breakfast, we had a refill of coffee that we had...","label":[[5,9,"FOOD"],[31,40,"FOOD"],[227,236,"FOOD"],[257,263,"FOOD"]],"Comments":[]}
{"id":901,"text":"Cool place!. Our hotel shuttle brought us out for some dinner and adult beverages.  This place really hit the spot.  The beers and food were really good and really hit the spot.  The atmosphere, even on a Tuesday night, was great.  I left completely stuffed!  I'd like...","label":[[0,4,"VIBE"],[55,61,"FOOD"],[131,135,"FOOD"]],"Comments":[]}
{"id":902,"text":"Sample and take home some Bent Water. Tasting room for Bent Water's ever changing lineup of craft beer. Flights and drafts at the bar Growlers and cans to go. Friendly knowledgable bar staff. Pretzels served but can order from local restaurants and have it delivered.","label":[[104,111,"BEER"],[134,142,"BEER"],[147,157,"BEER"],[159,167,"VIBE"],[192,200,"FOOD"]],"Comments":[]}
{"id":903,"text":"Great visit. Tourists coming through Plymouth, four of us ended up in Dirty Water on our way to the very underwhelming Plymouth Rock. We were welcomed in, given a bit of a mini-tour and introduced it the different spirits. I got a whiskey old fashioned and the others got gin & tonics and rum punch, all very good. Without an easy way to get bottles back to Chicago we left empty-handed. Our loss. In Plymouth definitely stop in Dirty Water!","label":[[231,252,"BEER"],[272,284,"BEER"],[289,298,"BEER"]],"Comments":[]}
{"id":904,"text":"Great local beer and bar food. y Dad grew up in Haverhill and finds it funny that people still flock to The Tap since he went here in his 20s and 30s.  The Tap has always had great beer - love the Leatherlips IPA and always like a bar that rotates...","label":[[25,29,"FOOD"],[197,212,"BEER"]],"Comments":[]}
{"id":905,"text":"Busy. Went here for a beer with the wife.... they were out of their IPA.... guess that means it's goodOrdered another \"ale\". Busy with beer drinkers.... what else.. ha","label":[[68,71,"BEER"]],"Comments":[]}
{"id":906,"text":"If you are a pub fan, this is a good place.. Nice place to get a good meal and sample the local beer.  Nicely designed to be a brewery, pub and gift shop all at once.  The windows to the working part are clever.  Outdoor tables allow you to stay a while.  Varied menu.  Three kinds of deviled eggs.  If I am ever close to Ipswich, I am stopping by again.","label":[[144,153,"FEATURE"],[213,220,"OUTDOOR"],[285,297,"FOOD"]],"Comments":[]}
{"id":907,"text":"Fun activity. Fort Hill Brewery is a really fun place to try out seem German beers and learn how its made and canned.  The crowd if very pleasant, and its a nice way to spend the afternoon.","label":[[44,47,"VIBE"],[70,76,"BEER"],[137,145,"VIBE"]],"Comments":[]}
{"id":908,"text":"Very Accommodating and Food Delicious. We had a wonderful early dinner after visiting the Botanical Gardens.  I had called ahead as one of our family members is in a wheelchair.  They were very accommodating and were prepared for us when we arrived.  We needed to sit in the tavern to...avoid the step up in the restaurant.  Bathroom was very large and accommodated the wheelchair well.  Food was delicious.  We had burgers and a Cajun chicken sandwich, which were all cooked perfectly with individually selected toppings.  Building is older and a little dusty, but overall we had a great experience and will definitely be back. BTW the large cookies are delicious too!","label":[[194,207,"VIBE"],[388,392,"FOOD"],[416,423,"FOOD"],[436,452,"FOOD"],[643,650,"FOOD"]],"Comments":[]}
{"id":909,"text":"Nice venue, high beer prices. Beer Prices are way to high for the quality.  Location is great (added a star for that). Did not try the food, so this review is purely based on beer.","label":[[135,139,"FOOD"]],"Comments":[]}
{"id":910,"text":"Busy and lively pkace. We had to wait to get in even on a Friday afternoon offseason, because it is just such a popular place. During Covid I would say I still felt relatively safe with servers masked and tables relatively distanced apart as well. We enjoyed the food carts, and the drinks were good. They even accommodated mocktail modifications.","label":[[0,4,"VIBE"],[9,15,"VIBE"],[263,267,"FOOD"],[324,332,"BEER"]],"Comments":[]}
{"id":911,"text":"Great local brewery!. y boyfriend and I have been going here regularly since they opened and it has grown into a busy place on weekend evenings and the staff are extremely friendly. They play great music and have live music wednesday nights. Their beers are fantastic- especially the Be Hoppy! ONLY downside is that they close so early. .. 9pm even on the weekends :(  but this is the brewery to check out if you come to Worcester !!","label":[[198,203,"MUSIC"],[218,223,"MUSIC"],[284,292,"BEER"]],"Comments":[]}
{"id":912,"text":"2-tiers (or maybe more) for quality of service . I visited several times over course of a week or so.  Food menu is extremely limited but quality pretty darned good for what’s offered.  Of course the beer is main attraction, and again pretty good. What bugs me here is the obvious favoritism displayed to...“regulars” and newcomers or non- regulars.  I routinely was passed-by in favor of “regulars” in different scenarios. Very annoying. And different treatment extends behind server attention to other aspects as well.  Anyway, good beer, good but very limited food selection, horrendous serious unless you want to commit to “regular” status.  I choose not.","label":[[103,107,"FOOD"],[563,567,"FOOD"]],"Comments":[]}
{"id":913,"text":"They will be missed. Closed permanently, and the last few batches of beer are selling out fast at the local groceries.  I will miss the Chocolate Oatmeal Stout.","label":[[136,159,"BEER"]],"Comments":[]}
{"id":914,"text":"High quality craft beer to be had and enjoyed!!. Some REAL good beers being made here!. So glad to have made journey. Make sure you are at Malden address as some GPS still show Everett\/original locale!","label":[],"Comments":[]}
{"id":915,"text":"Fun, Local, Cider, Beer and Music. This is a fun place to go. Take the kids for fruit picking, play grounds, train rides etc. and then treat yourself to a bite and drink in the Tap Room.  There is a nice selection of hard ciders and beers, locally brewed, and an...assortment of snacks\/bar food. In addition to the cozy taproom, there is a larger greenhouse with tables. There is also outdoor seating, but there's a sign that says town ordinance won't allow people outside after 6 PM. Too bad.  It would be an excellent spot for a summer night. The food is okay and the beer and cider choices are very good. There were lots of families with kids - I've come to realize that's a thing with breweries - all having a good time.  We were definitely the oldest people in the place. We went on a Friday night when they had live music. One of our friends commented that it was perfect for us 'seniors' as it started and ended early.","label":[[12,17,"BEER"],[28,33,"MUSIC"],[222,228,"BEER"],[279,285,"FOOD"],[290,294,"FOOD"],[315,319,"VIBE"],[347,357,"LOCATION"],[385,392,"OUTDOOR"],[549,553,"FOOD"],[579,584,"BEER"],[822,827,"MUSIC"]],"Comments":[]}
{"id":916,"text":"Evening in Everett. Huge taproom. Went on a Thursday evening and it was not very busy. There was a large selection of beers and seltzers to choose from. The servers were friendly. My wife and I each got a flight. Beers were OK.  Not much going on to keep us there.","label":[[128,136,"BEER"],[170,178,"VIBE"],[205,211,"BEER"]],"Comments":[]}
{"id":917,"text":"Nice stop for lunch: 1 was great and the other just OK.. Stopped in for lunch as we drove through the Berkshires.   Lots of cars \/ guests there.  We were seated promptly and ordered quickly.   In spite of the near capacity crowd on this day (July 4), the service \/ delivery was quite good.   Fish and chips...were spot on   The chicken parm, left us wanting for more.   It needed work.   Maybe a do over.  Interesting spot.","label":[[14,19,"FOOD"],[72,77,"FOOD"],[292,296,"FOOD"],[301,306,"FOOD"],[328,335,"FOOD"]],"Comments":[]}
{"id":918,"text":"Grab A Local Beer. y wife and I came here after lunch nearby on a Saturday before St. Patrick's Day. It was a bit busy and we had to wait about 30 mins outside before they would let us in. Once we got in though, we found a spot at the bar to order some beers as well as a place to sit. Their beer hall is great since you are able to order a wide selection of their beers, overlook their brewhouse but most importantly, have one of their giant pretzels with 2 dipping sauces!This place is very popular, so make sure you get here early. If you are from outside of the US, you must have your passport, no local driver's license at all. They check IDs at the door.","label":[[443,451,"FOOD"],[467,473,"FOOD"],[493,500,"VIBE"]],"Comments":[]}
{"id":919,"text":"Incredible Establishment. I am a beer snob. I brew my own and am particular on appearance, aroma, and taste. This place made me feel like I was drinking beer from a master brewer. I would expect this place to be in Somerville or Cambridge however, it is in the good old Burg! A must place to visit and is essential to bring future commerce back to the area!","label":[],"Comments":[]}
{"id":920,"text":"Great Brewery in an old mill. You might miss this place if you are looking for a big sign on Pleasant St.- look for a driveway on your right and go around the back to the parking lot for the entrance.There is outdoor seating and the service was friendly along with musicians for entertainment.  Lot's of character from the old mill bricks - great use for an old property.Only wish that they served food so I didn't have to drink on an empty stomach. Suitable for families if it's an adult family gathering.","label":[[20,28,"LOCATION"],[209,216,"OUTDOOR"],[245,253,"VIBE"],[265,274,"MUSIC"],[450,471,"FEATURE"]],"Comments":[]}
{"id":921,"text":"GREAT Place to go. Wonderfully renovated place. They brew their beer right there, and it is delicious! Smallish interior bar and a great, multi-level outdoor area where you can grab a bite to eat, have a beer or two, and they always have great local talent come and play music. Also have an outside bar, and picnic tables to sit at. Food is inventive, in that they bring in local vendors on different days to serve good grub... Call it, high-end food truck fare. Simply a great place to hang for a few hours.","label":[[31,40,"LOCATION"],[150,157,"OUTDOOR"],[271,276,"MUSIC"],[291,298,"OUTDOOR"],[308,321,"FEATURE"],[333,337,"FOOD"],[420,424,"FOOD"],[446,456,"FOOD"]],"Comments":[]}
{"id":922,"text":"Brewery Tour - Salem, Mass. This was our very first stop in Salem while waiting to check into our room.  The staff was friendly and knowledgeable and the beer, according to my husband was extremely tasty.  Down fall, we cannot buy this beer in Canada where we live.  The atmosphere...","label":[[119,127,"VIBE"]],"Comments":[]}
{"id":923,"text":"Another great place to eat, drink, relax in Dalton. A different place than your average bar. No TV (great), good pub food, and very good choice of local brewed beer. J.J. and Sam at the bar offer any help and suggest options on food and drinks.Good background music.","label":[[117,121,"FOOD"],[228,232,"FOOD"]],"Comments":[]}
{"id":924,"text":"Went to a car show with my daughter and visited the brewery while we were there.. The brewery is relatively new. The surroundings are beautiful, from the patio you can see forever. Beer prices are not cheap but pretty much in line with other brewery places. The environment is very nice. Not like sitting in a bar. There were actually several kids there running around and playing while their parents enjoyed a drink. Relaxed and mellow place.","label":[[154,159,"OUTDOOR"],[418,425,"VIBE"],[430,436,"VIBE"]],"Comments":[]}
{"id":925,"text":"My favorite dive bar, bar none. I'm a semi-regular at Owen's. Not everybody knows my name, but quite a few of the staff do. Maria behind the bar and John waiting tables are really good at keeping everyone happy.Owen's is a brew pub, though their brewing operation is offsite, I...","label":[],"Comments":[]}
{"id":926,"text":"Home Fries or Home Fires. We stopped in for breakfast and the home fries with a little extra capsicum kick were simply outstanding. The coffee was great and the staff friendly and attentive. This place is a Beacon Hill local, regulars and tourists abound. Absolutely perfect for breakfast.","label":[[5,10,"FOOD"],[44,53,"FOOD"],[62,72,"FOOD"],[279,288,"FOOD"]],"Comments":[]}
{"id":927,"text":"Pizza beers and outdoors. Had a great time. Great menu and some pretty decent beers. Great outdoor space with cornhole music etc. good for families with picnic tables and some space to run around. Definitely worth the visit. Shout out to our waiter Eli who did a great job!","label":[[0,5,"FOOD"],[16,24,"OUTDOOR"],[110,118,"GAMES"],[119,124,"MUSIC"],[130,147,"FEATURE"],[153,166,"FEATURE"]],"Comments":[]}
{"id":928,"text":"Good vibe, good beer, bring your food. I’m not much of a beer drinker, and I really like the beer here!  Birds of a Feather one of their best!","label":[[105,123,"BEER"]],"Comments":[]}
{"id":929,"text":"Family outing during Daffy weekend. Annually we visit the brewery during Daffy festival.  The weather was great, the music was fun, and the lobster rolls were fabulous.  It was a great crowd - family and friends enjoying the venue, beers and all of the festivities!!!","label":[[117,122,"MUSIC"],[140,153,"FOOD"]],"Comments":[]}
{"id":930,"text":"Great Taproom, great beers, reasonable prices, friendly atmosphere, \"tasting\" encouraged!!. y girlfriend and I first visited them at their original location, and this location is a great step-up we think! Open, friendly environment, excellent beers, especially the Mayacuya (if I'm spelling it right). We hope they keep this beer on the menu- year round!!      :)Tastings are encouraged, and its a really nice, friendly way to see what you gravitate towards..... For draft... they have 4oz pours, and 12oz pours....... both reasonably priced in my opinion- you can taste the quality coming through in their brews!!!!They offer such a great selection of beers, that we don't think it will be hard at all- to find something you'll love!!!!! A great place that we'll sure to be visiting over and over again!!!!Such a treat to have a place like this in our \"back yards\"!!!!!!!!!Sincerely, Bob and Terri.    :)","label":[[47,55,"VIBE"],[205,209,"VIBE"],[211,219,"VIBE"],[265,273,"BEER"]],"Comments":[]}
{"id":931,"text":"No Bangers in Bangers and Mash Poutine…. Ordered Bangers and Mash Poutine… received soggy french fries covered in cheese with no Banger sausage. Asked waitress and she pointed out a couple grain sized bits of nothing. No apologies, no sausage. Don’t order or expect and remedies for any food shortcomings.","label":[[3,10,"FOOD"],[14,30,"FOOD"],[31,38,"FOOD"],[49,65,"FOOD"],[66,73,"FOOD"],[97,102,"FOOD"],[114,120,"FOOD"],[129,143,"FOOD"],[287,291,"FOOD"]],"Comments":[]}
{"id":932,"text":"Seen one, you’ve seen them all. Good, not great. Pretty average brewery with a staff that doesn’t seem too knowledgeable about their brand unfortunately. The flights and variety of beers were great and thoroughly enjoyable. Having the ability to order a coffee on the way out was great too. Worth the...","label":[[56,63,"VIBE"],[158,165,"BEER"]],"Comments":[]}
{"id":933,"text":"Nice barrel aged beers!. Took a quick ride on the bike and stopped in for some nice barrel aged beers and took a few home as well.","label":[[84,95,"BEER"]],"Comments":[]}
{"id":934,"text":"We enjoyed the Iron Duke Brewery!. We loved visiting the Iron Duke Brewery this weekend.  If you go, ask about their name and history, it's a great story.","label":[],"Comments":[]}
{"id":935,"text":"Fabulous old mill renovated into a brewery. Gorgeous place with excellent beer in a great city. Owner is friendly, welcoming. Tasty appetizers. If you live in MA or NH, Amesbury is a worthwhile place to visit with a beautiful downtown. Go to Wolf Hill Farm cheese shop and Jewell Towne Vineyard, too.","label":[[0,8,"VIBE"],[9,17,"LOCATION"],[44,52,"VIBE"],[105,113,"VIBE"],[115,124,"VIBE"]],"Comments":[]}
{"id":936,"text":"Great place to go for an after dinner beer and relax. Went to this brewery after a waitress at the Brick House Tavern recommended it.  It has 10+ brews on tap.  Has a dining room up stairs and a large back yard where there is a fire pit and they have music on certain nights.","label":[[201,210,"OUTDOOR"],[228,236,"FEATURE"],[251,256,"MUSIC"]],"Comments":[]}
{"id":937,"text":"Rustic. This pace has a very rustic feel, as most breweries do these days. The beer is good and there is a decent selection.","label":[[0,6,"VIBE"],[29,35,"VIBE"]],"Comments":[]}
{"id":938,"text":"Great beers in Western MA. We stopped at Berkshire brewing in Deerfield MA to sample the local craft beers. They had a pretty broad beer menu to satisfy most beer lovers palates. They also sell flights so you can taste several before having to commit to just one. The list is extensive they likely had two dozen beers to choose. We all mixed it up, I got porters and ipa’s and loved them all. The nitro porter was especially tasty as was the green dress, mosaic, and inhopnito ipa. I ended up getting a pint after the flight of the mosaic ipa. We had a ways to drive home, so we had to keep it in the fairway. If we’d been staying locally or took a ride, we likely would have stayed to enjoy some more. Worth a stop if you’re in the area.","label":[[194,201,"BEER"],[355,362,"BEER"],[367,372,"BEER"],[397,409,"BEER"],[442,453,"BEER"],[455,461,"BEER"],[467,480,"BEER"],[518,524,"BEER"],[532,542,"BEER"]],"Comments":[]}
{"id":939,"text":"Love beer will travel... to Deerfield. One of the first tours and micro brews I was introduced to almost 8 years ago, and I still consider it the best tour I've ever taken. With all the choices out there, it's tough to stay loyal to one brand, but I still keep a BBC in my rotation, especially the old school styles. BBC Oktoberfest is my favorite.","label":[[56,61,"TOUR"],[151,155,"TOUR"],[321,332,"BEER"]],"Comments":[]}
{"id":940,"text":"brunch. I've been here a handfull of times, the beer is pretty good and the decor is great, but the food is usually mediocre at best. The service is not great either. We came for brunch and were the first ones there, the waitor seemed nice...","label":[[0,6,"FOOD"],[100,104,"FOOD"],[179,185,"FOOD"]],"Comments":[]}
{"id":941,"text":"Nice relaxing place. Really nice place to go for a drink\/food at the end of a long day visiting Boston. Close to commons and really nice waitress","label":[[5,13,"VIBE"],[57,61,"FOOD"]],"Comments":[]}
{"id":942,"text":"Don't Judge A Book By It's Cover. The space is unique and quaint, far cooler than what the outside of the building would suggest.  The craft beers are excellent, despite limited choices.  The food is small plate or boards of various types, very good, but certainly not full sized meals.  Service was...very good and we enjoyed our time there.  Will definitely be back.  A cool, little hidden gem.","label":[[47,53,"VIBE"],[58,64,"VIBE"],[192,196,"FOOD"],[385,395,"VIBE"]],"Comments":[]}
{"id":943,"text":"HUGE guessing game. The establishment needs an Operational Manager.  No signs.  Long lines.  You'll have to figure out how to buy a beer, where to buy a beer.  Do I stand in this line?   Is this line for food or beer?","label":[[204,208,"FOOD"]],"Comments":[]}
{"id":944,"text":"A Great Addition To Downtown. Recently opened in the heart of New Bedford in an historic former bank, Greasy Luck is a welcome addition to downtown. Conveniently located and only steps from the trendy Historic District, greasy Luck offers great service, excellent craft beers made on the premises, excellent service,...","label":[[89,100,"LOCATION"]],"Comments":[]}
{"id":945,"text":"Polar vortex. Incredible brew. Place was packed for their 4th anniversary weekend celebration with lots of friendly patrons. Couldn’t resist bringing some home. Go and enjoy!","label":[[0,12,"BEER"]],"Comments":[]}
{"id":946,"text":"Pretty good beer!. Good beer. Good food. Great service.  What more can you ask for? Good atmosphere too. Love the outside seating? Even easy parking.Highly recommend!","label":[[114,121,"OUTDOOR"],[141,148,"FEATURE"]],"Comments":[]}
{"id":947,"text":"Need a bathroom and chairs . We stopped in at this cute brewery on our way off the Cape. The beer was tasty and the selection was good. The experience however could be improved if they had an indoor bathroom, I hate Porta potty‘s, and chairs to sit at.  Staff were friendly and I’m sure we will return. Hope they have chairs and an indoor bathroom by then!","label":[[51,55,"VIBE"],[265,273,"VIBE"]],"Comments":[]}
{"id":948,"text":"Love local breweries . Was visiting in the area. Looking for a nice place to grab a local beer. (Like to do that when traveling.) Found CraftRoots Brewing in Melford. Great place and great beer. Like the decor. You can sit at the bar or at one of the tables where the tops are the shape of beer bottle caps. Friendly service goes along with the nice beer selections. Became a fan of their Irish Dry Stout. If I wasn't flying home I'd take a couple squealers to go!","label":[[308,316,"VIBE"],[389,404,"BEER"]],"Comments":[]}
{"id":949,"text":"mmmmm beer. y wife and I strolled here after dinner, walking from our hotel.  Offered ten or so beers, some of their own and some that they brew for others.  I had no problem finding a beer, but my wife isn't a huge fan of craft beers so she had some problem until we started talking to one of the servers.  He finally found something that she liked.  Very attentive, very friendly.  Inside they have snack type foods (pretzels with mustard or salsa or guac), etc.  Outside next to the deck was a food truck, not sure what they were serving.  On the tables there is also games (Connect 4, Battleship, etc).  Good tunes, fun time, good brew.","label":[[373,381,"VIBE"],[401,406,"FOOD"],[412,417,"FOOD"],[419,427,"FOOD"],[433,440,"FOOD"],[444,449,"FOOD"],[453,457,"FOOD"],[497,507,"FOOD"],[571,576,"GAMES"],[578,587,"GAMES"],[589,599,"GAMES"]],"Comments":[]}
{"id":950,"text":"Get in the Spirits !. Looking for a variety of home town, home made, liquor? This is the place! You can sample the goods and they are all good. Limoncello,  vodka, gin, whiskey to name a few. Started offering beer as well. Staff it friendly, accommodating and informative. If you are visiting Plymouth, this is a stop you wont want to miss.","label":[[232,240,"VIBE"],[242,255,"VIBE"]],"Comments":[]}
{"id":951,"text":"GREAT SERVICE. Stop by Sunday afternoon for a couple beers  with friends  Ang was our server well what a great time we had Ang was great 10 🌟service THANKS Bob Dunphy","label":[],"Comments":[]}
{"id":952,"text":"Fun Place to Visit. We went here with some friends and had a great time. The atmosphere is fun and there are many beer choices on tap. The bar itself is kind of small, and they didn’t have many selections other than beer. They also do not offer food. The staff were super friendly.","label":[[91,94,"VIBE"],[161,166,"LOCATION"],[272,280,"VIBE"]],"Comments":[]}
{"id":953,"text":"Inner Circle????. So we have visited this brewery multiple times and if they open early we have alwaysbeen welcomed in. We went at 11:45 this morning and we were sent away from the bouncer since we were not part of the inner club that we needed to pay for we were not welcomed in and not allowed back until 12 noon when they officially opened. Very disappointed that we needed to pay to get into a inner circle and sent way because  we were not part of an club ?!?! Sorry I will not be back since I have to meet inner circle standards.","label":[],"Comments":[]}
{"id":954,"text":"Great patio location!. Patio and gastro pub, West Acton. Great service, food and ambiance in West Acton. Easy option after work for good food and indoor or outdoor eating.","label":[[6,11,"OUTDOOR"],[23,28,"OUTDOOR"],[72,76,"FOOD"],[137,141,"FOOD"],[156,163,"OUTDOOR"]],"Comments":[]}
{"id":955,"text":"simply put...Awesome Beer and place!. Great new addition (within year) to brew scene. Awesome selection, great staff, and very cool vibe both inside and out on patio. Already a definite return any time going through on 95!!","label":[[127,131,"VIBE"],[160,165,"OUTDOOR"]],"Comments":[]}
{"id":956,"text":"Meh. We love a good brewery, unfortunately, this one did not do it for us.  None of the seasonal sours were available.  The IPA’s that were available were not up to our usual expectations.  Beer’d and Grey Sail may have spoiled us for the rest.","label":[[124,129,"BEER"],[190,196,"BEER"],[201,210,"BEER"]],"Comments":[]}
{"id":957,"text":"Great brews and nice staff. Stopped in driving from Boston to see family after finding this on Google maps.  Happy to see a new brewery in WMass.Beer list was, sorry, wicked good and I could have tried most of the list.  I settled on a New England IPA and...a Belgian Wit beer for my pints.  Both delicious and well balanced beers.Staff was soooooooooo friendly and offered samples.  Bartenders that actually talk to you?  What?  I am not a person who goes into places and then spends the whole time on my phone.  I was happy the server\/bartender was willing to chat.   I guess now a days, it's not very common for people to be social.I grabbed two crowlers (32oz cans) that are poured and canned right in front of you.  Worth taking some home as long as you don't have a super long drive.  Reasonably priced also when you realize you're getting to pints of beer.  I split them with my dad when I got home.I will definitely be returning on my next visit home to see family and I'm dragging them here to try the beer.","label":[[236,251,"BEER"],[260,271,"BEER"],[353,361,"VIBE"],[649,657,"BEER"]],"Comments":[]}
{"id":958,"text":"Live music adds to the atmosphere. Came in with a group on a Saturday night and found a table fairly quickly.  It was a seat yourself situation, but a server was right there and very responsive through our visit.  We had a couple of beer flights, a Brie cheese board and a salted dunking pretzel.  The bar food was fine.  Like my experience with a lot of breweries, some of the beers I liked and some not so much.  I'm happy that the flights are offered, as it is obviously a good way to get to know new products.  The beer I really liked was called Bad Omen, but that wouldn't keep me from getting it again.  The place was hopping on a Saturday night and extremely noisy...even before the band started.  Plenty of parking one block south.  This is a big place, which made the service that much more outstanding.  If I wanted to have a conversation with the people in my group, I'd come back in the daytime and hope for a little less noise.  Other than the very limited bar menu, no food served here.  But they encourage BYOF and give the phone numbers of local restaurants that deliver.","label":[[5,10,"MUSIC"],[238,245,"BEER"],[254,260,"FOOD"],[288,295,"FOOD"],[306,310,"FOOD"],[434,441,"BEER"],[550,558,"BEER"],[624,631,"VIBE"],[690,694,"MUSIC"],[715,722,"FEATURE"]],"Comments":[]}
{"id":959,"text":"Beer, music, games, Nintendo, corner piano. When I first walked into Aeronaut (I didn't have to wait in line on this particular Saturday evening, but I was warned that that's a common occurrence), I thought, \"cool joint.\" Kind of your typical brewery space... beer on tap, descriptions of said beer cheerfully and colorfully displayed on giant chalkboards, community tables, space for musicians. The beer we tried was really good, and we went through a decent variety.It wasn't until I sauntered back to the restroom that I discovered there was SO MUCH MORE. A) There's a machine that dispenses flavored soda water. B) There's a piano in the corner open to the public. C) Picnic-type tables that are perfect for groups. D) I'm pretty sure I saw some old-school arcade games.When I returned from the restroom, the band was playing at a spot near the front door. Really good sound that stayed in the front area—it didn't travel into the back beer hall. There was someone playing Tetris in the corner, the screen was the wall for all to watch, mesmerized. You forget how fun it is to watch someone else play Tetris until it's happening. Cool space, good beer. A great option against your typical pub or bar.","label":[[6,11,"MUSIC"],[13,18,"GAMES"],[20,28,"GAMES"],[37,42,"FEATURE"],[209,213,"VIBE"],[357,373,"FEATURE"],[385,394,"MUSIC"],[629,634,"FEATURE"],[712,718,"FEATURE"],[768,773,"GAMES"],[813,817,"MUSIC"],[977,983,"GAMES"],[1134,1138,"VIBE"]],"Comments":[]}
{"id":960,"text":"Small batch, nano brewery. Seems like the owners are living every beer lovers dream -- brewing hand-crafted beer and getting so good at it they can sell it.  Open only two days a week -- Wednesday nights and Saturday afternoons.  You can buy one of their bottles and get it filled for take out or you can sit at the bar and try a few pints.  The refillable bottles are smaller than the usual 64 oz growlers, but are still about three pints worth.  They have sampler 'flights' or you could just ask for a taste before you choose.  All the beers I've had are small batch, fresh and tasty.  A far cry from the mass-produced stuff.  No food, but Wendell's is directly across the street and they encourage you to grab a few wings to go, sit in their place and have a few of their beers.  Every time I go in to refill, the bar is full.  They have a few tables to sit at.","label":[[255,262,"BEER"],[357,364,"BEER"],[467,474,"BEER"]],"Comments":[]}
{"id":961,"text":"Great spot   Good beer. Love the space. Big outdoor and indoor space.   Kid friendly and tons of games to play. . Good craft beer.   Double ipa great. And their stout was good too.","label":[[44,51,"OUTDOOR"],[72,84,"FEATURE"],[97,102,"GAMES"],[133,143,"BEER"],[161,166,"BEER"]],"Comments":[]}
{"id":962,"text":"Great environment with frequent popups. Always great beers on tap and always something new to try. I especially love how often they feature pop up restaurants making it fun to go out grab a beer, try new food and play some board games.  A germ in the town of Norwood and worth a stop if you're passing through or if you live nearby.","label":[[32,38,"FOOD"],[204,208,"FOOD"],[229,234,"FOOD"]],"Comments":[]}
{"id":963,"text":"Weekend before Thanksgiving visit. I visited this brewery on the weekend before Thanksgiving. The venue was busy, which is a good sign. I had the root beer, and it was very good. The service was very good, and it was overall a great experience.","label":[[108,112,"VIBE"]],"Comments":[]}
{"id":964,"text":"I can't help but REPEAT!. This is a local FAVORITE! Worth the trip to get a draft beer. They have specific times for tours. Call ahead if that's important. I got lucky my first time. They have great  t-shirts. I like that the bartenders will talk about the beer and the start up of the company. Try their Porter on tap. Bring a growler if you want to fill it up!!! Enjoy! Buy some beer! I wish they would sell the porter in cans soon!","label":[[305,311,"BEER"],[328,335,"BEER"],[414,420,"BEER"]],"Comments":[]}
{"id":965,"text":"Nice beers!  Good food, great service!. Travelling for the afternoon, doing some brewery tours, and had the chance to stop in at The Tap in Haverhill.   Met Ashley who was working a.m. Bar and she was GREAT!  Friendly and welcoming and knew her beers!  Stayed for lunch and had an excellent...bowl of chili that they make with one of their lager beers they brew on-site.  Old school taproom and restaurant space.  Cozy and welcoming.","label":[[209,217,"VIBE"],[222,231,"VIBE"],[264,269,"FOOD"],[301,306,"FOOD"],[340,345,"BEER"],[372,382,"VIBE"],[414,418,"VIBE"],[423,432,"VIBE"]],"Comments":[]}
{"id":966,"text":"Great Beer & Chow. Dine in is closed during Covid-19 but they are doing curbside pickup starting at 3pm.  I stopped by to pick up some of their new Pride and Parquet Lager... in collaboration with the Boston Celtics.  They have so many different types of beers, find the...one you like. Food is good too.","label":[[13,17,"FOOD"],[148,171,"BEER"],[287,291,"FOOD"]],"Comments":[]}
{"id":967,"text":"The Tap. Went here for dinner.  Got a beer and a lobster roll in a deli roll with fries.  it was really stuffed.  Nice to see that for a change.  The roll was bigger than a hot dog roll for a change.  Great waitress too.","label":[[23,29,"FOOD"],[49,61,"FOOD"],[67,76,"FOOD"],[82,87,"FOOD"],[173,180,"FOOD"]],"Comments":[]}
{"id":968,"text":"Local brewery with GREAT selection. Drunken Rabbit has a great selection of brews, ciders and mixed drinks. Table games and local music as well. The staff were so kind and really knew the options. A food truck compliments your food options, but they also allow you to get food delivered...there.","label":[[83,89,"BEER"],[94,106,"BEER"],[114,119,"GAMES"],[130,135,"MUSIC"],[199,209,"FOOD"],[227,231,"FOOD"],[272,276,"FOOD"]],"Comments":[]}
{"id":969,"text":"Great time . I had a blast here with my mom in 2015. We had great waitstaff and great view of the street where we could lookout at downtown. Great restaurant.","label":[],"Comments":[]}
{"id":970,"text":"Sunday beer brunch. . Excellent selection of craft beer and delicious breakfast sandwiches from the Mystic station restaurant for an early Sunday start to the day.","label":[[12,18,"FOOD"],[80,90,"FOOD"]],"Comments":[]}
{"id":971,"text":"Cisco disappoints. We stood a few feet away from the van pick- up spot but missed it as we did not see the 4\" sign posted to a wooden pole. So we had to wait for the next one. When we arrived we learned there was a  $10 cover charge!  This was not on their website. They explained that it was because they were really busy?  What kind of reasoning is that? We were warned that 12 oz cup of beer is $8. A can of the same beer at the pizza place is only $3. With all the money they pull in they could certainly afford more seating as it was crazy busy. Also, if you are over 35 you'll stand out like a show thumb!","label":[[545,549,"VIBE"]],"Comments":[]}
{"id":972,"text":"Beer Tasting at its best!. We remember waiting for Fort Hill Brewery to open and when they opened it was worth the wait.  The building is spacious, clean, and modern.   The staff do give tours and is very informative.  Weekend's are the busiest with tasting the different craft beers.  They have entertainment also.  We go over when we have time on the weekends and are looking forward to warmer weather to sit outside and enjoy the view of the Holyoke Range.  The staff is very friendly and accommodating.  The brewery is popular and you can see that with the amount of traffic coming with people bringing in their empty growlers for refills.  If in the area do stop by, but look up in Facebook to see their operating hours.  A very enjoyable experience and fun place to go.","label":[[138,146,"LOCATION"],[159,165,"LOCATION"],[187,192,"TOUR"],[296,309,"FEATURE"],[411,418,"OUTDOOR"],[479,487,"VIBE"],[492,505,"VIBE"],[523,530,"VIBE"],[622,630,"BEER"]],"Comments":[]}
{"id":973,"text":"This is a good local place if you like hard cider or beer and pizza. This is a great local place if you like hard cider or beer and pizza.  I liked:•\tthe great bartender. •\tthe three seating areas - outside with picnic tables, heated\/cooled greenhouse with soft chairs\/sofas, and inside with tables and live music.•\tThe...hard cider. •\tThe pilsner beerI was not crazy about•\tThe limited food menu – mostly flat bread pizza and some chicken wings.  Jack’s Abbey and Battle Road taprooms have much better food.  I guess I was expecting a more farm friendly menu.•\tThe “soft pretzels” – the Harpoon taproom has much better ones.•\tThe porter and red ale – I thought Jack’s Abbey, Battle Road , and Harpoon were better, but of course this is all subjective.•\tThe live music – good but not great when we visited.  But I liked that we could move to the soft chairs in the green house where it was quieter, but you could still hear the music.  And am glad they attempt to host live music since there are not many other venues nearby.•\tThe outdoor area has some green bushes but I guess I was expecting more flowers at a farm.","label":[[44,49,"BEER"],[62,67,"FOOD"],[114,119,"BEER"],[132,137,"FOOD"],[199,206,"OUTDOOR"],[308,313,"MUSIC"],[340,347,"BEER"],[387,391,"FOOD"],[417,422,"FOOD"],[432,445,"FOOD"],[572,580,"FOOD"],[631,637,"BEER"],[642,649,"BEER"],[763,768,"MUSIC"],[928,933,"MUSIC"],[974,979,"MUSIC"],[1031,1038,"OUTDOOR"],[1112,1116,"LOCATION"]],"Comments":[]}
{"id":974,"text":"Great fun . We loved trying the local brews in both flights and pints - Stout was the best ! We looked forward to the chocolate stout cake too but it was sold out :( we sat outside and the manager gladly turned the heater on for us....Izzy offered great service and was able to describe all the brews available. We enjoyed the nachos & catfish as well as the burger and yummy onion rings.","label":[[72,77,"BEER"],[327,333,"FOOD"],[336,343,"FOOD"],[359,365,"FOOD"],[376,387,"FOOD"]],"Comments":[]}
{"id":975,"text":"Great birthday. We came here on a party bus with a group of people for my birthday this past weekend. There was a great band playing, a pool table and plenty of room. The bartender (I wish I had caught her name) was so attentive and accommodating of our group and really went out of her way to make sure we were happy. We will definitely be back with our pup!","label":[[120,124,"MUSIC"],[233,246,"VIBE"],[355,358,"DOG"]],"Comments":[]}
{"id":976,"text":"A work in progress . The beer here is not too bad. Given all the great beer in the area they have a ways to go. The Toll Gate IPA was probably the best of the bunch.","label":[[116,125,"BEER"]],"Comments":[]}
{"id":977,"text":"Big Fan - Got my first Growler - Becoming a Regular. Prior to this, I haven't really been a big beer drinker because I can't take much carbonation.  But this beer is different and sits very well with me.  They also have a wide variety of tastes and bodies with 2 or 3 new ones in the mix at any time.  I prefer darker, bitter beers so the Cadence is my usual.  But I do try a new one almost every week.  David and Heather behind the bar are both very nice and give good service.  The atmosphere is laid back and meant for conversation so the clientele are also laid back and easy to talk to.    You can bring food in or have it delivered,  They do have popup kitchens most Friday nights but you can see for yourself on their website.  Seats at the bar (more like a poured cement countertop) with tables in the back.  It's normally not crazy busy but it will be if the Wooden Noodles or the One Love Café are selling food; be warned!  Downside - small parking lot.  Seats aren't comfortable.  Décor is \"grunge bike garage\".  You might run into me!   Upside - Really good beer.  Nice people.   Laid Back.  Growlers to go if you want.  Tips aren't accepted - they go to a charity that changes every month.  The business structure is a coop - you can buy in at $150.","label":[[23,30,"BEER"],[339,346,"BEER"],[498,507,"VIBE"],[653,667,"FOOD"],[1092,1101,"VIBE"],[1104,1112,"BEER"]],"Comments":[]}
{"id":978,"text":"Good beer, pricey. You have to be here for the beer, in an industrial part of Everett.  They do have snacks, but no food unless a food truck has been scheduled.  The beer is good, if somewhat pricey at $6.5 including taxes for a 13oz 'full size' glass.  There are toys for kids, the tabletops are black board with chalk which allows you to get in at least a drink or 2 if you have family.  There are also a couple of classic video games \/ pinball machines.  The old loading dock has been creatively turned into a patio.","label":[[101,107,"FOOD"],[130,140,"FOOD"],[264,277,"FEATURE"],[431,436,"GAMES"],[439,446,"GAMES"],[513,518,"OUTDOOR"]],"Comments":[]}
{"id":979,"text":"Some good beers but wildly packed. I thought this was a pretty average brewery. When we visited this place it was packed and people were jumping on departing guests to snipe their tables. The chair stools weren’t all that comfy and one of the tables we stood next to was wobbly...which is frightening with a pitcher of water and multiple beer glasses on top of it. There is a limited food selection here and the food was actually quite good. The bartenders themselves were ok. The female bartender on a Saturday afternoon was unenthused to say the least, but the male bartender was a bit more friendly. The space itself is VERY loud and the seating areas feel very haphazardly organized and not all that aesthetically pleasing. I don’t expect a zen and quiet experience at a brewery but it felt like chaos mixed with the hunger games over the limited available seating. There are also many many IPAs on tap so if you’re not an IPA fan, like me, this brewery will have a very limited selection for you. Upon purchasing beer to go, the guy working the checkout station spent a good amount of time flirting and chatting with the girls in front of me (even after they paid) inquiring all about their vacation to Boston. However when I was paying for my beer, I once again received unenthused service. I don’t want to be judgmental of people I don’t know, but there looked to be a very high proportion of what looked to be white brodouches. Definitely not my favorite brewery or my favorite beer selection and certainly not a place I would go out of the way to visit again.","label":[[384,388,"FOOD"],[412,416,"FOOD"],[895,899,"BEER"],[927,930,"BEER"],[1018,1028,"BEER"]],"Comments":[]}
{"id":980,"text":"Good beer. Nice local craft brewery, offering 5 different beers during our visit.  Their Belgian white, pale ale and stout were very tasty.  I'm not a big fan of IPAs, of which they had two offerings...but others who are fans enjoyed them quite a bit.  Will definitely visit again and search out their beer for sale in local stores.","label":[[89,96,"BEER"],[104,112,"BEER"],[117,122,"BEER"],[162,166,"BEER"]],"Comments":[]}
{"id":981,"text":"Best Craft Beer around. One of the best Craft beer brewery in MA located in North, MA on route 123 exit 10 off RT 495. You will not be disappointed.","label":[],"Comments":[]}
{"id":982,"text":"Best neighborhood bar. Best neighborhood bar ever, all the bartenders rock, the beer Is always cold, the atmosphere lively, they also have a delightful backyard, now that Is summer it should be enjoyed.","label":[[116,122,"VIBE"],[152,160,"OUTDOOR"]],"Comments":[]}
{"id":983,"text":"Did we try the wrong things on the menu?. So we came here on the recommendation of a local as we were in town for a few days . The local in question suggested that this place was the best place to eat in all of Great Barrington. We were seated quickly and the...","label":[],"Comments":[]}
{"id":984,"text":"Love the atmosphere!. While out and about we ran across Westfield River and stopped in – good choice! They have great beers and wines and a super menu. The dining room has a great fireplace with warm ambiance, and an outdoor patio for the warmer months. The staff there were super nice and welcoming. Must see!","label":[[128,133,"BEER"],[180,189,"FEATURE"],[195,199,"VIBE"],[217,230,"OUTDOOR"]],"Comments":[]}
{"id":985,"text":"I wish Punch You in the IPA Came out of my Tap. I believe CBC's Punch You in the IPA is the most blown away I have ever been by a beer. It is pure juice. If juicy beers aren't your thing, of course this one isn't for you, but if they are, this is the best...you'll ever taste. I've never had a juicier beer. Punch You in the IPA is thick and profoundly fruit forward. If you're a hazy IPA fan, CBC is worth going to for this beer alone. That said, the Belgian Tripel was also excellent, as were the chicken nachos.","label":[[24,27,"BEER"],[64,73,"BEER"],[452,466,"BEER"],[499,513,"FOOD"]],"Comments":[]}
{"id":986,"text":"😋👍. When I first tried the tap was not impressed now yrs later everything has changed better service the quality and quantity of food is fantastic the have put a ton of effort into their outside deck better and more seating plants flowers overall great job...and don’t forget the view of the Merrimack river try it and enjoy 🍻","label":[[131,135,"FOOD"],[189,196,"OUTDOOR"]],"Comments":[]}
{"id":987,"text":"Loved this place. Five of us from north county had stood outside watching family participate in a high school track meet down the road in the cold and rain. Walking into a warm wonderfully repurposed venue was terrific!  Great decor. Check out The website for photos. Nicest waitstaff...very helpful and they knew their menu and were happy to advise. We had different dinners from the Wilted Spinach Salad to The Beefeater with their house-smoked brisket and a variety of their other offerings. Amazing.  Drinks and wine really well done and the choices of beer was delicious. As a huge perk each first Thursday of the month they present the Berkshire Jazz band - 15 members strong!  Amazing sound. Totally entertaining. We are going to be seeing a lot of The Shire. They know how to do things right!","label":[[400,405,"FOOD"],[447,454,"FOOD"],[516,520,"BEER"],[657,661,"MUSIC"]],"Comments":[]}
{"id":988,"text":"Cool Brewery at MoCA. Stopped by to try their beers and enjoyed our visit. They brew their own beer right in plain display, you can see them working as you enjoy a pint or two.","label":[],"Comments":[]}
{"id":989,"text":"Truffle fries coma. The truffle fries are to die for here and the beer is even better there non meat options are great as well the veggie quesadilla is awesom","label":[[8,13,"FOOD"],[32,37,"FOOD"],[131,137,"FOOD"],[138,148,"FOOD"]],"Comments":[]}
{"id":990,"text":"Great Brewery. Loved this brewery! The beer was decent, the food was phenomenal! Philippe, the chef, cooks out of his food truck and everything was so amazing. Great atmosphere and they have a disc golf course so you can play and drink some beers. Dogs are allowed also which is an awesome addition. Would highly recommend if you are in the area.","label":[[60,64,"FOOD"],[118,128,"FOOD"],[193,202,"FEATURE"],[248,252,"DOG"]],"Comments":[]}
{"id":991,"text":"Lots of good beer and great food. This place was surprisingly busy for a Tuesday, but they handled it well. A really good food selection for a small place. You'll love the Red Sox and Patriots themes in the beer names.","label":[[28,32,"FOOD"],[122,126,"FOOD"]],"Comments":[]}
{"id":992,"text":"Great place . Stopped in this weekend and enjoyed the brewery. Great atmosphere and bar area. Servers were a pleasure to deal with and very knowledgeable. Will be back","label":[],"Comments":[]}
{"id":993,"text":"A great place to have lunch or dinner in the city.. This restaurant is a gem.I have been going back for food or drinks in this restaurant for a couple of years now, and I have never had a bad experience.The service is excellent and the food is superb, with a great modern atmosphere...","label":[[22,27,"FOOD"],[31,37,"FOOD"],[73,78,"VIBE"],[104,108,"FOOD"],[236,240,"FOOD"],[265,271,"VIBE"]],"Comments":[]}
{"id":994,"text":"great beer and awesome food!. They have big picnic tables, games you can play- plus good beer and food.  Menu was small but hubby and I both found things to eat :)","label":[[40,57,"FEATURE"],[59,64,"GAMES"],[98,102,"FOOD"]],"Comments":[]}
{"id":995,"text":"fun change from fast food on I-95. Just passing by, we detoured here for a bite and to taste some beer. The reuben is hot and gooey--a mess to eat, but delicious. The beer is even better, with a good variety of styles to choose from. Located in the old downtown and...","label":[[108,114,"FOOD"]],"Comments":[]}
{"id":996,"text":"Fun local brewery. Stopped into Medusa on Christmas eve to try their beers. Between my friend and I we sampled everything on tap that day. All of it was good to very good, balanced, not terribly hoppy or high ABV. The pretzels come to the table warm and soft and are a good way to offset your beer intake. You can order food from local restaurants and have it delivered to the brewery (or BYO) if you want to. The tasting room itself is a good size with a bar area and a more traditional seating area. There were a few families in that second part with small kids, so it is certainly a family friendly spot. The growler line looked to be moving quickly. The staff at the bar (no table service) were efficient, friendly and knowledgable. If you are somehow in the area, it is worth stopping by.","label":[[218,226,"FOOD"],[586,601,"FEATURE"],[612,619,"BEER"],[710,718,"VIBE"]],"Comments":[]}
{"id":997,"text":"Nice place for drinks and appetizers. We sat outside and enjoyed drinks and some great warm pretzels.  We wanted to return for dinner but didn't get the chance.","label":[[26,36,"FOOD"],[45,52,"OUTDOOR"],[92,100,"FOOD"]],"Comments":[]}
{"id":998,"text":"Good Beer!. Excellent Beer! Went on the tour at 11 but the guy just talks to you he does not take you anywhere in the brewery. Did the tasting it was all pretty good! I just didn't like the porter! I brought home a growler of red! I gotta drink it still! Don't get hot dogs from the food truck. They are gross! Worst food I had the whole time in cod! Well only bad food..... Would return just eat somewhere else first.","label":[[40,44,"TOUR"],[190,196,"BEER"],[215,222,"BEER"],[265,273,"FOOD"],[283,293,"FOOD"],[317,321,"FOOD"],[365,369,"FOOD"]],"Comments":[]}
{"id":999,"text":"Beautiful. Beautiful redo of a historic building - tastefully done, and \"TASTE\"fully done!So much activity here - and the jazz nights with musicians far and near are awesome.Ginger Ale and Ginger brew are very tasty - as are the other libations...You'll LOVE it!","label":[[31,48,"LOCATION"],[139,148,"MUSIC"],[189,195,"BEER"]],"Comments":[]}
{"id":1000,"text":"Very good will be a 5 star once can buy pints. I really like visiting Castle Island Brewery, its in a big old warehouse and has a cool vibe. You can try a bunch of beers with their free samples but can't buy pints. Their beers are almost all on the hoppy side. I don't love hops but I do like supporting local business and I like all their not overly hoppy beer.They have lots of swag for sale aswell as their canned beer. They have big plans to expand and start being able to sell pints. I look forward to that.","label":[[106,119,"LOCATION"],[130,134,"VIBE"]],"Comments":[]}
